Yona-W/OpeNITHM/Firmware/Teensy/boards.txt
menu.usb=USB Type
menu.speed=CPU Speed
menu.opt=Optimize
menu.keys=Keyboard Layout

#teensy4b2.name=Teensy 4-Beta2
#teensy4b2.upload.maximum_size=1572864
#teensy4b2.upload.maximum_data_size=262144
#teensy4b2.upload.tool=teensyloader
#teensy4b2.upload.protocol=halfkay
#teensy4b2.build.board=TEENSY40
#teensy4b2.build.core=teensy4
#teensy4b2.build.mcu=imxrt1062
#teensy4b2.build.warn_data_percentage=99
#teensy4b2.build.toolchain=arm/bin/
#teensy4b2.build.command.gcc=arm-none-eabi-gcc
#teensy4b2.build.command.g++=arm-none-eabi-g++
#teensy4b2.build.command.ar=arm-none-eabi-gcc-ar
#teensy4b2.build.command.objcopy=arm-none-eabi-objcopy
#teensy4b2.build.command.objdump=arm-none-eabi-objdump
#teensy4b2.build.command.linker=arm-none-eabi-gcc
#teensy4b2.build.command.size=arm-none-eabi-size
#teensy4b2.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib
#teensy4b2.build.flags.dep=-MMD
#teensy4b2.build.flags.optimize=-Os
#teensy4b2.build.flags.cpu=-mthumb -mcpu=cortex-m7 -mfloat-abi=hard -mfpu=fpv5-d16
#teensy4b2.build.flags.defs=-D__IMXRT1062__ -DTEENSYDUINO=146
#teensy4b2.build.flags.cpp=-std=gnu++14 -fno-exceptions -fpermissive -fno-rtti -fno-threadsafe-statics -felide-constructors -Wno-error=narrowing
#teensy4b2.build.flags.c=
#teensy4b2.build.flags.S=-x assembler-with-cpp
#teensy4b2.build.flags.ld=-Wl,--gc-sections,--relax "-T{build.core.path}/imxrt1062.ld"
#teensy4b2.build.flags.libs=-larm_cortexM7lfsp_math -lm -lstdc++
#teensy4b2.build.fcpu=396000000
#teensy4b2.serial.restart_cmd=false
#teensy4b2.menu.usb.serial=Serial
#teensy4b2.menu.usb.serial.build.usbtype=USB_SERIAL
#teensy4b2.menu.usb.keyboard=Keyboard
#teensy4b2.menu.usb.keyboard.build.usbtype=USB_KEYBOARDONLY
#teensy4b2.menu.usb.keyboard.fake_serial=teensy_gateway
#teensy4b2.menu.usb.touch=Keyboard + Touch Screen
#teensy4b2.menu.usb.touch.build.usbtype=USB_TOUCHSCREEN
#teensy4b2.menu.usb.touch.fake_serial=teensy_gateway
#teensy4b2.menu.usb.hidtouch=Keyboard + Mouse + Touch Screen
#teensy4b2.menu.usb.hidtouch.build.usbtype=USB_HID_TOUCHSCREEN
#teensy4b2.menu.usb.hidtouch.fake_serial=teensy_gateway
#teensy4b2.menu.usb.hid=Keyboard + Mouse + Joystick
#teensy4b2.menu.usb.hid.build.usbtype=USB_HID
#teensy4b2.menu.usb.hid.fake_serial=teensy_gateway
#teensy4b2.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
#teensy4b2.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
#teensy4b2.menu.usb.midi=MIDI
#teensy4b2.menu.usb.midi.build.usbtype=USB_MIDI
#teensy4b2.menu.usb.midi.fake_serial=teensy_gateway
#teensy4b2.menu.usb.midi4=MIDIx4
#teensy4b2.menu.usb.midi4.build.usbtype=USB_MIDI4
#teensy4b2.menu.usb.midi4.fake_serial=teensy_gateway
#teensy4b2.menu.usb.midi16=MIDIx16
#teensy4b2.menu.usb.midi16.build.usbtype=USB_MIDI16
#teensy4b2.menu.usb.midi16.fake_serial=teensy_gateway
#teensy4b2.menu.usb.serialmidi=Serial + MIDI
#teensy4b2.menu.usb.serialmidi.build.usbtype=USB_MIDI_SERIAL
#teensy4b2.menu.usb.serialmidi4=Serial + MIDIx4
#teensy4b2.menu.usb.serialmidi4.build.usbtype=USB_MIDI4_SERIAL
#teensy4b2.menu.usb.serialmidi16=Serial + MIDIx16
#teensy4b2.menu.usb.serialmidi16.build.usbtype=USB_MIDI16_SERIAL
#teensy4b2.menu.usb.audio=Audio
#teensy4b2.menu.usb.audio.build.usbtype=USB_AUDIO
#teensy4b2.menu.usb.audio.fake_serial=teensy_gateway
#teensy4b2.menu.usb.serialmidiaudio=Serial + MIDI + Audio
#teensy4b2.menu.usb.serialmidiaudio.build.usbtype=USB_MIDI_AUDIO_SERIAL
#teensy4b2.menu.usb.serialmidi16audio=Serial + MIDIx16 + Audio
#teensy4b2.menu.usb.serialmidi16audio.build.usbtype=USB_MIDI16_AUDIO_SERIAL
#teensy4b2.menu.usb.mtp=MTP Disk (Experimental)
#teensy4b2.menu.usb.mtp.build.usbtype=USB_MTPDISK
#teensy4b2.menu.usb.mtp.fake_serial=teensy_gateway
#teensy4b2.menu.usb.rawhid=Raw HID
#teensy4b2.menu.usb.rawhid.build.usbtype=USB_RAWHID
#teensy4b2.menu.usb.rawhid.fake_serial=teensy_gateway
#teensy4b2.menu.usb.flightsim=Flight Sim Controls
#teensy4b2.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
#teensy4b2.menu.usb.flightsim.fake_serial=teensy_gateway
#teensy4b2.menu.usb.flightsimjoystick=Flight Sim Controls + Joystick
#teensy4b2.menu.usb.flightsimjoystick.build.usbtype=USB_FLIGHTSIM_JOYSTICK
#teensy4b2.menu.usb.flightsimjoystick.fake_serial=teensy_gateway
#teensy4b2.menu.usb.disable=No USB
#teensy4b2.menu.usb.disable.build.usbtype=USB_DISABLED

#teensy4b2.menu.opt.o2std=Faster
#teensy4b2.menu.opt.o2std.build.flags.optimize=-O2
#teensy4b2.menu.opt.o2std.build.flags.ldspecs=
#teensy4b2.menu.opt.o2lto=Faster with LTO
#teensy4b2.menu.opt.o2lto.build.flags.optimize=-O2 -flto -fno-fat-lto-objects
#teensy4b2.menu.opt.o2lto.build.flags.ldspecs=-fuse-linker-plugin
#teensy4b2.menu.opt.o1std=Fast
#teensy4b2.menu.opt.o1std.build.flags.optimize=-O1
#teensy4b2.menu.opt.o1std.build.flags.ldspecs=
#teensy4b2.menu.opt.o1lto=Fast with LTO
#teensy4b2.menu.opt.o1lto.build.flags.optimize=-O1 -flto -fno-fat-lto-objects
#teensy4b2.menu.opt.o1lto.build.flags.ldspecs=-fuse-linker-plugin
#teensy4b2.menu.opt.o3std=Fastest
#teensy4b2.menu.opt.o3std.build.flags.optimize=-O3
#teensy4b2.menu.opt.o3std.build.flags.ldspecs=
#teensy4b2.menu.opt.o3purestd=Fastest + pure-code
#teensy4b2.menu.opt.o3purestd.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__
#teensy4b2.menu.opt.o3purestd.build.flags.ldspecs=
#teensy4b2.menu.opt.o3lto=Fastest with LTO
#teensy4b2.menu.opt.o3lto.build.flags.optimize=-O3 -flto -fno-fat-lto-objects
#teensy4b2.menu.opt.o3lto.build.flags.ldspecs=-fuse-linker-plugin
#teensy4b2.menu.opt.o3purelto=Fastest + pure-code with LTO
#teensy4b2.menu.opt.o3purelto.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__ -flto -fno-fat-lto-objects
#teensy4b2.menu.opt.o3purelto.build.flags.ldspecs=-fuse-linker-plugin
#teensy4b2.menu.opt.ogstd=Debug
#teensy4b2.menu.opt.ogstd.build.flags.optimize=-Og
#teensy4b2.menu.opt.ogstd.build.flags.ldspecs=
#teensy4b2.menu.opt.oglto=Debug with LTO
#teensy4b2.menu.opt.oglto.build.flags.optimize=-Og -flto -fno-fat-lto-objects
#teensy4b2.menu.opt.oglto.build.flags.ldspecs=-fuse-linker-plugin
#teensy4b2.menu.opt.osstd=Smallest Code
#teensy4b2.menu.opt.osstd.build.flags.optimize=-Os --specs=nano.specs
#teensy4b2.menu.opt.osstd.build.flags.ldspecs=
#teensy4b2.menu.opt.oslto=Smallest Code with LTO
#teensy4b2.menu.opt.oslto.build.flags.optimize=-Os -flto -fno-fat-lto-objects --specs=nano.specs
#teensy4b2.menu.opt.oslto.build.flags.ldspecs=-fuse-linker-plugin

